/*
 * Copyright(C) 2013,V-Checker 保留所有权利。( All rights reserved. )
 * 
 * 文件名称：OBDRClsUtilities.h
 * 摘    要：工具类，全局可用
 * 当前版本：1.0
 * 作    者：Yipb
 * 创建日期：2013年12月5日
 */
#pragma once

//屏幕分辨率
enum SCREEN_RESOLUTION
{
	RESOLUTION_480X272, 
	RESOLUTION_800X480,
};


class CUtilities
{
public:
	CUtilities(void);
	~CUtilities(void);
};

// CSplashWnd 消息处理程序
//----------------------------------------------------------------------


//************************************************************************************
//函    数：fDrawImage
//功    能：从指定资源文件根据资源ID加载图片                                 
//参    数：dcMem-----------背景图片DC
//			parentDC--------画板DC，用来创建背景图片DC
//			rect------------图片大小
//			hInstance-------资源句柄
//			nIDResource-----图片资源ID
//			lpType----------图片类型
//返    回: 无
//************************************************************************************
void fCommDrawImage(CDC * dcMem,CBitmap * cBitmap,CDC * dcParent,const CRect rect,const HINSTANCE hInstance,UINT nIDResource,CString lpType=_T("PNG"));

//************************************************************************************
//函    数：fGetAppPath()      
//功    能：当前应用运行路径
//参    数：
//返    回: 当前应用运行路径
//************************************************************************************
CString fCommGetAppPath();

//************************************************************************************
//函    数：fW2C
//功    能：宽字节转单字节                      
//参    数：pwstr---------源宽字节数组
//			pcstr---------转换后的单字节数组
//			len-----------数据长度
//返    回: 获取运行程序路径
//************************************************************************************
void fCommW2C(const wchar_t *pwstr,char *pcstr,size_t len);

//************************************************************************************
//函    数：fCommStr2Hex
//功    能：将一个十六进制串字符串转化数值                  
//参    数：pwstr---------源单字节数组
//			pcstr---------转换后的宽字节数组
//			len-----------数据长度
//返    回: 获取运行程序路径
//************************************************************************************
DWORD fCommStr2Hex(CString strHex);

//************************************************************************************
//函    数：fGetResStr
//功    能：从指定资源文件根据资源ID加载字符串                              
//参    数：hInstance----------资源句柄
//			dwResID------------资源ID
//返    回: 获取到的资源字符串
//************************************************************************************
CString  fCommGetBinFileText(DWORD dwID,CString strBinFileName);


//************************************************************************************
//函    数：fIEEE745ToFloat
//功    能：                   
//参    数：dwValue----------
//返    回: 
//************************************************************************************
float fIEEE745ToFloat(DWORD dwValue);


//************************************************************************************
//函    数：fCommStrSplit
//功    能：将一个字符串作为vector，用bSplitChar分隔，               
//参    数：str----------
//			bSplitChar----------
//返    回: 
//************************************************************************************
vector<CString> fCommStrSplit(CString str, BYTE bSplitChar);

//************************************************************************************
//函    数：fKillProcess
//功    能：              
//参    数：
//返    回: 
//************************************************************************************
void fCommKillProcess(CString strProcessName);

//************************************************************************************
//函    数：fCommFindProcess
//功    能：              
//参    数：
//返    回: 
//************************************************************************************
BOOL fCommFindProcess(CString strProcessName);
// 运行指定可执行文件
BOOL fCommRunProcess(CString strFullPathName);
// 检查文件是否存在
BOOL fCommIsExistFile(CString strFullPathName);
//
void fCommPlaySound(CString strPathFile);